[
  {
    "original": "الرَّحْمَنُ",
    "latin": "AR-RAHMAAN",
    "meaning": "The Most or Entirely Merciful",
    "explanation": "Allah, Ar-Rahmaan, bestows His Mercy (Rahmah) upon all the creatures in this universe."
  },
  {
    "original": "الرَّحِيمُ",
    "latin": "AR-RAHEEM",
    "meaning": "The Bestower of Mercy",
    "explanation": "The Owner of Mercy that encompasses His creation. Ar-Rahmaan points to the vastness of Allah’s Mercy and Ar-Raheem points out to the effect of this Mercy on His Creation."
  },
  {
    "original": "الْمَلِكُ",
    "latin": "AL-MALIK",
    "meaning": "The King and Owner of Dominion",
    "explanation": "The One who possesses the attribute of Mulk (kingdom), dominion, power, authority. Allah is Al Malikul Haqq. He is the One who possesses the disposal of all affairs. He commands, makes and does whatever He wants. And Allah gives Mulk to whoever He wants, as Mulk belongs to Him."
  },
  {
    "original": "الْقُدُّوسُ",
    "latin": "AL-QUDDUS",
    "meaning": "The Absolutely Pure",
    "explanation": "The One who is Very Pure, Absolutely Pure. He is far and above any imperfection, error, fault and shortcoming. He is High above what does not befit Him. He is the one who is Taahir (Pure) and Uluww (High)."
  },
  {
    "original": "السَّلاَمُ",
    "latin": "AS-SALAM",
    "meaning": "The Perfection and Giver of Peace",
    "explanation": "The One who is Free from all imperfections and deficiencies because of the Perfection of His Being, of His Attributes and His Actions (Ibn Kathir). He keeps His creations safe from any injustice on His part."
  },
  {
    "original": "الْمُؤْمِنُ",
    "latin": "AL-MU’MIN",
    "meaning": "The One Who gives Emaan and Security",
    "explanation": "The One who Affirms and Believes (Eeman) His Oneness and the One who gives Emaan. It is also The One who gives Security (Aman) and Peace. Al-Mu’min is also the One who removes the fear and the One who is Faithful. His promises are always true."
  },
  {
    "original": "الْمُهَيْمِنُ",
    "latin": "AL-MUHAYMIN",
    "meaning": "The Guardian, The Witness, The Overseer",
    "explanation": "The One who observes His creation with regards to their actions. It is also The One Who offers peace and security and The Trustworthy One who proclaims the Truth. He is the One who always watches us and looks after us."
  },
  {
    "original": "الْعَزِيزُ",
    "latin": "AL-AZEEZ",
    "meaning": "The All Mighty",
    "explanation": "The One who overpowers everything and Who cannot be overcome. It also refers to the One who is extremely precious, none is like Him. He is unbeatable and nothing can prevent Him from fulfilling what He wills."
  },
  {
    "original": "الْجَبَّارُ",
    "latin": "AL-JABBAR",
    "meaning": "The Compeller, The Restorer",
    "explanation": "Al-Jabbaar is the Compeller, whatever He will is what happens. He is the One who is Exalted, High above His creation and He is the One who Reforms, the One who fixes the situation for His creation."
  },
  {
    "original": "الْمُتَكَبِّرُ",
    "latin": "AL-MUTAKABBIR",
    "meaning": "The Supreme, The Majestic",
    "explanation": "Al-Mutakabbir is the Supreme, He reveals His Greatness and Power at every moment and in every incident. Al-Mutakabbir use His rights, privileges and attributes that are above and beyond the rights of everyone else."
  },
  {
    "original": "الْخَالِقُ",
    "latin": "AL-KHAALIQ",
    "meaning": "The Creator, The Maker",
    "explanation": "The One Who brings things into existence after their non-existence. Who invents and innovates without a prior model. And then bestows upon them their characteristics of movement and other qualities. He is the One Who invents whatever the eyes can see and perfects their creation."
  }

]
